# -*- coding: utf-8 -*-
#高级特性：
#1.切片
#取出list的前几个元素
L=[0,1,2,3,4,5,6,7,8,9]
print(L[0:3])#表示从索引0开始 直接取到3为止，但是不包括索引3
#如果第一个索引是0，还可以这么写
print(L[:4])
#也可以取负数，最后一个值的索引为-1
print(L[-2:])
#1.1定一个L 0-99的数列
L = list(range(100))
print(L)
#1.2取出前10个
print(L[:10])
#1.3取出后10个
print(L[-10:])
#1.4取出11-20个
print(L[10:20])
#1.5前10个数，没隔两个取一个
print(L[:10:2])
#1.6所有的数字没隔着5个取出一个
print(L[::5])
#1.7tuple
print((0, 1, 2, 3, 4, 5)[:3])
#1.8字符串
print('ABCDEFG'[:3])
print('ABCDEFG'[::4])

L = ['Michael', 'Sarah', 'Tracy', 'Bob', 'Jack']

print('L[0:3] =', L[0:3])
print('L[:3] =', L[:3])
print('L[1:3] =', L[1:3])
print('L[-2:] =', L[-2:])

R = list(range(100))
print('R[:10] =', R[:10])
print('R[-10:] =', R[-10:])
print('R[10:20] =', R[10:20])
print('R[:10:2] =', R[:10:2])
print('R[::5] =', R[::5])

#2.迭代

